# Chapter 7 数据清洗和准备

In [2]:
from numpy import nan as NA
import pandas as pd
import numpy as np

In [5]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [6]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [9]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
cleaned=data.dropna()

In [11]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [12]:
cleaned=data.dropna(how='all') #只丢弃全为na的行

In [13]:
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [15]:
df = pd.DataFrame(np.random.randn(7, 3))

In [16]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [17]:
df.fillna(0)

          0         1         2
0  0.135826  0.000000  0.000000
1  0.135075  0.000000  0.000000
2 -0.648346  0.000000  1.860277
3 -2.201111  0.000000  1.843664
4 -1.525726  0.629309  1.700618
5 -1.825814 -1.395324  1.229347
6  0.745203  0.159261  0.709213

若是通过一个字典调用fillna，就可以实现对不同的列填充不同的值

In [18]:
df.fillna({1:0.5,2:3})

          0         1         2
0  0.135826  0.500000  3.000000
1  0.135075  0.500000  3.000000
2 -0.648346  0.500000  1.860277
3 -2.201111  0.500000  1.843664
4 -1.525726  0.629309  1.700618
5 -1.825814 -1.395324  1.229347
6  0.745203  0.159261  0.709213

In [19]:
df.isnull().any()

0    False
1     True
2     True
dtype: bool

In [20]:
df.isnull().any(1) #行缺失值的情况

0     True
1     True
2     True
3     True
4    False
5    False
6    False
dtype: bool

指定thresh值，则表示当某行/列数据非缺失值数超过指定数值时才保留

In [21]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [22]:
df.dropna(thresh=2) #行非缺失值至少为2个

          0         1         2
2 -0.545140       NaN -0.157863
3  0.039776       NaN  0.488674
4 -0.168595 -1.096926 -0.306750
5 -0.470269 -0.770649  0.065942
6 -0.254803  0.533159 -0.309392

In [23]:
df

          0         1         2
0 -0.253194       NaN       NaN
1  1.433168       NaN       NaN
2 -0.545140       NaN -0.157863
3  0.039776       NaN  0.488674
4 -0.168595 -1.096926 -0.306750
5 -0.470269 -0.770649  0.065942
6 -0.254803  0.533159 -0.309392

In [24]:
df.fillna(method='bfill')

          0         1         2
0 -0.253194 -1.096926 -0.157863
1  1.433168 -1.096926 -0.157863
2 -0.545140 -1.096926 -0.157863
3  0.039776 -1.096926  0.488674
4 -0.168595 -1.096926 -0.306750
5 -0.470269 -0.770649  0.065942
6 -0.254803  0.533159 -0.309392

backfill 利用NA的下一个值来进行填充
ffill 利用NA的前一个值来进行填充

均值填充

In [25]:
df.fillna(df.mean())

          0         1         2
0 -0.253194 -0.444805 -0.043878
1  1.433168 -0.444805 -0.043878
2 -0.545140 -0.444805 -0.157863
3  0.039776 -0.444805  0.488674
4 -0.168595 -1.096926 -0.306750
5 -0.470269 -0.770649  0.065942
6 -0.254803  0.533159 -0.309392

In [26]:
df.drop_duplicates()

          0         1         2
0 -0.253194       NaN       NaN
1  1.433168       NaN       NaN
2 -0.545140       NaN -0.157863
3  0.039776       NaN  0.488674
4 -0.168595 -1.096926 -0.306750
5 -0.470269 -0.770649  0.065942
6 -0.254803  0.533159 -0.309392

In [27]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

## 利用函数或映射进行数据转换

In [58]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork','bacon','pastrami', 'corned beef','bacon','pastrami', 'honey ham', 'novalox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5,6]})

In [59]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8      novalox     6.0

In [60]:
meat_to_animal={
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'novalox': 'salmon'
}

In [61]:
lowercased=data['food'].str.lower()

In [62]:
data['food']

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8        novalox
Name: food, dtype: object

In [43]:
data['animal']=lowercased.map(meat_to_animal)

In [44]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8      novalox     6.0  salmon

## map函数

In [64]:
data['food'].map(lambda x: meat_to_animal[x])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## 替换值

In [73]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [74]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [70]:
data.replace(-999,np.nan)  #单独写NaN是不存在的！

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [72]:
data.replace([1,2],[np.nan,0])

0       NaN
1    -999.0
2       0.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [75]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [83]:
data.rename(index={0:'a'})

a       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

## 离散化和面元分隔

In [84]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [85]:
bins = [18, 25, 35, 60, 100]

In [86]:
cats=pd.cut(ages,bins)

In [87]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [89]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [90]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [91]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [93]:
pd.cut(ages,[18,27,88])

[(18, 27], (18, 27], (18, 27], (18, 27], (18, 27], ..., (27, 88], (27, 88], (27, 88], (27, 88], (27, 88]]
Length: 12
Categories (2, interval[int64]): [(18, 27] < (27, 88]]

In [98]:
group_names=['young','old']

In [99]:
pd.cut(ages,[18,25,80],labels=group_names)

[young, young, young, old, young, ..., old, old, old, old, old]
Length: 12
Categories (2, object): [young < old]

In [101]:
data=np.random.rand(20)

In [107]:
pd.cut(data,4,precision=2) #precision 限定小数只有2位

[(0.71, 0.94], (0.017, 0.25], (0.71, 0.94], (0.25, 0.48], (0.25, 0.48], ..., (0.71, 0.94], (0.25, 0.48], (0.017, 0.25], (0.017, 0.25], (0.48, 0.71]]
Length: 20
Categories (4, interval[float64]): [(0.017, 0.25] < (0.25, 0.48] < (0.48, 0.71] < (0.71, 0.94]]

In [108]:
a=_

In [109]:
a.categories

IntervalIndex([(0.017, 0.25], (0.25, 0.48], (0.48, 0.71], (0.71, 0.94]]
              closed='right',
              dtype='interval[float64]')

qcut是一个非常类似于cut的函数，它可以根据样本分位数对数据进行面元划分。
根据数据的分布情况，cut可能无法使各个面元中含有相同数量的数据点。而qcut
由于使用的是样本分位数，因此可以得到大小基本相等的面元：

In [112]:
data=np.random.randn(1000)

In [113]:
cats=pd.qcut(data,4)

In [114]:
cats.categories

IntervalIndex([(-3.082, -0.701], (-0.701, -0.012], (-0.012, 0.653], (0.653, 3.417]]
              closed='right',
              dtype='interval[float64]')

In [115]:
cats.value_counts()

(-3.082, -0.701]    250
(-0.701, -0.012]    250
(-0.012, 0.653]     250
(0.653, 3.417]      250
dtype: int64

qcut可以自定义分位数

In [116]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.356, -0.012], (-1.356, -0.012], (-0.012, 1.343], (-3.082, -1.356], (-0.012, 1.343], ..., (1.343, 3.417], (-1.356, -0.012], (-0.012, 1.343], (-1.356, -0.012], (-1.356, -0.012]]
Length: 1000
Categories (4, interval[float64]): [(-3.082, -1.356] < (-1.356, -0.012] < (-0.012, 1.343] < (1.343, 3.417]]

In [117]:
cats=_

In [118]:
cats.categories

IntervalIndex([(-3.082, -1.356], (-1.356, -0.012], (-0.012, 1.343], (1.343, 3.417]]
              closed='right',
              dtype='interval[float64]')

In [120]:
cats.value_counts()

(-3.082, -1.356]    100
(-1.356, -0.012]    400
(-0.012, 1.343]     400
(1.343, 3.417]      100
dtype: int64

# 检测和过滤异常值

In [121]:
data=pd.DataFrame(np.random.randn(1000,4))

In [123]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.025323    -0.019420     0.026571    -0.069984
std       1.005132     0.966506     0.965550     0.973052
min      -3.205412    -3.144521    -3.348006    -3.293669
25%      -0.627695    -0.633283    -0.636131    -0.698413
50%       0.024371     0.005455     0.011822    -0.074817
75%       0.692932     0.572145     0.684429     0.585255
max       3.403425     2.904251     3.360277     3.448344

In [124]:
col=data[2]

In [125]:
col[np.abs(col)>3]

159   -3.348006
628   -3.023308
814    3.360277
950    3.198849
Name: 2, dtype: float64

In [130]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
132 -0.043944 -1.474281  0.293959 -3.293669
159 -0.085439  0.365341 -3.348006 -0.584194
223 -3.205412  0.288110  1.160436 -0.472914
287  0.694043 -3.144521  0.094638 -0.551877
303 -0.619266  0.446995  0.296937  3.166961
369  1.917218 -3.057431 -0.453840  1.346045
378  3.403425 -1.422796 -0.476911  0.039752
628  0.892191  0.095409 -3.023308  1.323297
814  0.460530 -0.234727  3.360277  0.371741
864  0.249421 -0.149502 -1.174693  3.130083
950 -1.018625  0.445079  3.198849  1.674481
960  1.840032  0.321947 -0.073897  3.448344

any(1)用来选出全部所在行

In [131]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [132]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.025125    -0.019218     0.026384    -0.070436
std       1.003214     0.965870     0.962506     0.969636
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.627695    -0.633283    -0.636131    -0.698413
50%       0.024371     0.005455     0.011822    -0.074817
75%       0.692932     0.572145     0.684429     0.585255
max       3.000000     2.904251     3.000000     3.000000

In [133]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0 -1.0
1  1.0  1.0  1.0  1.0
2 -1.0 -1.0  1.0 -1.0
3 -1.0 -1.0 -1.0  1.0
4 -1.0  1.0 -1.0 -1.0

In [134]:
data.sample(n=3)

            0         1         2         3
61   0.194293 -0.312587 -0.410698 -1.091756
845 -0.260983  0.161584  0.173997  0.197574
793  0.155316 -1.169091  0.006927 -1.862565

通过替换的方式选择样本，允许有重复值

In [138]:
choices=pd.Series([1,0,3,-5,2,5])

In [139]:
draw=choices.sample(n=10,replace=True)

In [140]:
draw

5    5
1    0
0    1
4    2
0    1
3   -5
2    3
1    0
5    5
2    3
dtype: int64

## 计算指标/哑变量

一种常用于统计建模或机器学习的转换方式是：将分类变量（categorical
variable）转换为“哑变量”或“指标矩阵”。
如果DataFrame的某一列中含有k个不同的值，则可以派生出一个k列矩阵或
DataFrame（其值全为1和0）

In [141]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})

In [142]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [144]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [145]:
dummies=pd.get_dummies(df['key'],prefix='key')

In [146]:
df_with_dummy=df[['data1']].join(dummies)

In [148]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

## 字符串对象方法

In [149]:
val='a,b, github'

In [150]:
val.split(',')

['a', 'b', ' github']

In [151]:
pieces= [x.strip() for x in val.split(',')]

In [153]:
pieces

['a', 'b', 'github']

In [155]:
fri,sec,thr=pieces

In [156]:
fri+':'+sec+':'+thr

'a:b:github'

In [157]:
'::'.join(pieces)

'a::b::github'

In [158]:
'a' in val

True

In [159]:
val.index(',')

1

In [160]:
val.find('::')

-1

In [161]:
val.find(',')

1

1是存在，-1是不存在

In [162]:
val.count(',')

2

In [163]:
val.replace(',',':::')

'a:::b::: github'

## re

In [164]:
import re

In [165]:
text = "foo bar\t baz \tqux"

In [167]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

## Chapter 8 数据规整：聚合、合并和重塑

**- 层次化索引**

*层次化索引（hierarchical indexing）是pandas的一项重要功能，它使你能在一
个轴上拥有多个（两个以上）索引级别。抽象点说，它使你能以低维度形式处理高
维度数据。*

In [3]:
data = pd.Series(np.random.randn(9),index=[['a', 'a', 'a', 'b', 'b', 'c', 'c','d', 'd'],[1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [4]:
data

a  1    1.290088
   2    0.500151
   3   -0.037843
b  1    0.354324
   3    1.156571
c  1    1.061143
   2    1.894903
d  2   -0.438250
   3   -0.607019
dtype: float64

In [5]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [6]:
data['b']

1    0.354324
3    1.156571
dtype: float64

In [7]:
data['c':'d']

c  1    1.061143
   2    1.894903
d  2   -0.438250
   3   -0.607019
dtype: float64

In [8]:
data.loc[['b','d']]

b  1    0.354324
   3    1.156571
d  2   -0.438250
   3   -0.607019
dtype: float64

In [9]:
data[:2]

a  1    1.290088
   2    0.500151
dtype: float64

In [11]:
data.loc[:,2] #在内层选取

a    0.500151
c    1.894903
d   -0.438250
dtype: float64

In [13]:
data.unstack()

          1         2         3
a  1.290088  0.500151 -0.037843
b  0.354324       NaN  1.156571
c  1.061143  1.894903       NaN
d       NaN -0.438250 -0.607019

**- 使用DF的列索引**

In [14]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),'c': ['one', 'one', 'one', 'two','two','two', 'two'],'d': [0, 1, 2, 0, 1, 2, 3]})

In [15]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [21]:
frame2=frame.set_index(['c','d'])

In [22]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [18]:
frame2=frame.set_index(['c','d'],drop=False)

In [19]:
frame2

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [23]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

**- 合并数据集**

In [25]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a','b'],'data1': range(7)})

In [26]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})

In [27]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [28]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [31]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

**- 轴向连接**

In [33]:
arr = np.arange(12).reshape((3, 4))

In [34]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [37]:
np.concatenate([arr,arr],axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [38]:
pd.concat([df1,df2])

D:\software\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   data1  data2 key
0    0.0    NaN   b
1    1.0    NaN   b
2    2.0    NaN   a
3    3.0    NaN   c
4    4.0    NaN   a
5    5.0    NaN   a
6    6.0    NaN   b
0    NaN    0.0   a
1    NaN    1.0   b
2    NaN    2.0   d